BOT_WHAT_CAN_I_DO = (
    "Вот что я умею:\n"
    "• 🔎 Поиск фильмов по названию\n"
    "• ⭐ Поиск фильмов по рейтингу\n"
    "• 💰 Поиск фильмов по бюджету\n"
    "• 🕓 Просмотр истории твоего поиска\n"
)

BOT_WELCOME_TEXT = (
    "Я бот для поиска фильмов и сериалов 🎬\n"
    "Готов помочь тебе найти интересное кино!\n\n"
)

BOT_PRESS_TO_CONTINUE = "Нажми, чтобы продолжить 👇"

BTN_HELP_TXT = "Помощь"
BTN_MAIN_MENU_TXT = "Главное меню"
BTN_SEARCH_BY_NAME = "🎬 Поиск по названию"
BTN_SEARCH_BY_RATING = "⭐ Поиск по рейтингу"
BTN_SEARCH_LOW_BUDGET = "💸 С низким бюджетом"
BTN_SEARCH_HIGH_BUDGET = "💰 С высоким бюджетом"
BTN_SEARCH_HISTORY = "📜 История поиска"

ERR_COMMON = (
    f"⚠️ Сервис временно недоступен."
    f"Мы уже знаем о проблеме и работаем над её решением 🙂"
)

ERR_KINOPOISK_UNAVAILABLE = "😔 Кинопоиск сейчас недоступен, попробуйте позже."
