BOT_WHAT_CAN_I_DO = (
    "Вот что я умею:\n"
    "• 🔎 Поиск фильмов по названию\n"
    "• ⭐ Поиск фильмов по рейтингу\n"
    "• 💰 Поиск фильмов по бюджету\n"
    "• 🕓 Просмотр истории твоего поиска\n"
)

BOT_WELCOME_TEXT = (
    "Я бот для поиска фильмов и сериалов 🎬\n"
    "Готов помочь тебе найти интересное кино!\n\n"
)

BOT_PRESS_TO_CONTINUE = "Нажми, чтобы продолжить 👇"
BOT_SEARCH_RESULTS = "🔍 Вот что удалось найти по вашему запросу:"
BOT_SEARCH_RESULTS_NOT_FOUND = (
    "По вашему запросу ничего не найдено 😔\n"
    "Попробуйте заново:"
)
BOT_PAGINATE_ALREADY_FIRST_PAGE_SELECT = "Вы уже на первой странице"
BOT_PAGINATE_ALREADY_LAST_PAGE_SELECT = "Вы уже на последней странице"

BTN_BACK_TXT = "⬅️ Назад"
BTN_FORWARD_TXT = "Вперёд ➡️"
BTN_HELP_TXT = "Помощь"
BTN_MOVIE_WATCHED = "✅ Просмотрен"
BTN_MOVIE_UNWATCHED = "🕓 Не смотрел"
BTN_MAIN_MENU_TXT = "Главное меню"
BTN_SEARCH_BY_NAME = "🎬 Поиск по названию"
BTN_SEARCH_BY_RATING = "⭐ Поиск по рейтингу"
BTN_SEARCH_LOW_BUDGET = "💸 С низким бюджетом"
BTN_SEARCH_HIGH_BUDGET = "💰 С высоким бюджетом"
BTN_SEARCH_HISTORY = "📜 История поиска"

ERR_COMMON = (
    f"⚠️ Сервис временно недоступен."
    f"Мы уже знаем о проблеме и работаем над её решением 🙂"
)

ERR_KINOPOISK_UNAVAILABLE = "😔 Кинопоиск сейчас недоступен, попробуйте позже."
ERR_GIVEN_EMPTY_NAME = "Пустое название. Введите любое слово 🙂"
ERR_INVALID_PAGE_SIZE = "Неверно указан размер страницы"

USER_REQUEST_MOVIE_NAME = "🔎 Введите название фильма:"
USER_REQUEST_PAGE_SIZE = "Сколько результатов показать на странице?"
